#HTML เบื้องต้น
"""
"โครงสร้าง HTML"
<!DOCTYPE html> #ตัวบอกว่าเป็นhtmlอะไร(ในทีนี้คือ5)
<html> #ตัวครอบทุกอย่าง
    <head> #ตัวเปิดส่วนหัว ผู้ใช้มองไม่เห็น(การตั้งค่าต่างๆ,ข้อมูลหลังบ้าน) 
    ...เนื้อหา...
    <style>
    ...สไตล์...
    </style>
    </head> #ตัวปิดส่วนหัว(/)
    <body> #ตัวเปิดส่วนร่างกาย ผู้ใช้มองเห็น(ปุ่ม,ข้อความ,ฟอร์มกรอกข้อมูลต่างๆ)
    ...เนื้อหา...
    </body> #ตัวปิดส่วนร่างกาย(/)
</html> #ตัวครอบปิดทุกอย่าง 

"html Element"
ก้คือ แท็กเปิด + เนื้อหาข้างใน + แท็กปิด(ทั้งก้อนเลย)

<!--วิธีการคอมเมน-->

"html:5"
พิม html:5 ในช่องเเรกก้จะขึ้น

<!DOCTYPE html> <!--ตัวบอกว่าเป็นhtmlอะไร-->
<html lang="en"> <!--ตัวบอกว่าเนื้อหาในเว็บนี้ใช้ภาษาอิง เปลี่ยนตรง"en"-->
<head>
    <meta charset="UTF-8"> <!--ใส่เพื่อให้เบราว์เซอร์อ่านออก(ไม่ภาษาต่างดาว)-->
    <meta name="viewport" content="width=device-width, initial-scale=1.0"> <!--ตัวตั้งค่าการเเสดงผลในอุปกรณ์ต่างๆ-->
    <title>Document</title> <!--คือ แท็กกำหนดชื่อหัวข้อของหน้าเว็บ เปลี่ยนตรงDocument-->
</head>
<body>
    
</body>
</html>

"การจัดกลุ่มด้วย div,span" Project12.html
เวลาเเต่งข้อความก้จะอยุ่กลุ่มใครกลุ่มมัน

<span> เป็นการจัดกลุ่มเเบบบรรทัดเดียว มักใช้กับประโยคสั้นๆที่อยากให้มีลูกเล่นพิเศษ
    สวัสดี<span style="color: red;">ออม</span> วันนี้คีย์บอร์ดมาส่ง

        <!--จัดรูปเเบบในคําว่า<span style="color: red;">--> 

<div> เป็นการจัดกลุ่มข้อความเเบบบังคับให้ขึ้นบรรทัดใหม่ มักใช้ในการเเบ่งBlock
    สวัสดี 
    <div style="background-color: yellow;"> 
        ออม วันนี้คีย์บอร์ดมาส่ง
    </div>
    สู้ๆ

    <!--จัดรูปเเบบในคําว่า<div style="background-color: yellow;"> --> 
     
"การสร้างเเบบฟอร์มกรอกข้อมูล" Project13.html

1.โครงสร้างหลัก
ต้องมีตัว <form> </form> ครอบ 
ส่วน align="center" ก้คือคําสั่งจัดกึ่งกลางหน้าจอ
ตัวอย่างเนื้อหาด้านใน <form> </form>

#ตัวที่1
<div> #การจัดกลุ่มข้อความเเบบบังคับให้ขึ้นบรรทัดใหม่ 
    <label for="fn">ชื่อจริง</label>
    <input type="text" name="fname" id="fn" placeholder="ป้อนชื่อของคุณ" required>       
</div>
#อธิบาย1
<div> </div> =การจัดกลุ่มข้อความเเบบบังคับให้ขึ้นบรรทัดใหม่ 
<label> </label> =ตัวบอกว่าจะให้กรอกข้อมูลอะไร #<label>ข้อความที่จะให้เเสดง</label>
for="" id="" =ตัวเชื่อมระหว่างป้ายชื่อ (<label>) กับช่องกรอกข้อมูล (<input>) เข้าด้วยกันให้รู้ว่าเป็นคู่กัน
<input เนื้อหาต่างๆบลาๆ> =ตัวรับข้อมูล
type="" =ตัวบอกประเภทข้อมูล (type="text"ในที่นี้คือข้อความ)
placeholder="" =ข้อความตัวหนังสือจางๆ ที่ลอยอยู่ข้างในช่องกรอกข้อมูล
required =คือบังคับให้ต้องกรอกข้อมูลก่อนกดส่งฟอร์ม

#ตัวที่2
<div>
    <label for="ee">อายุ</label>
    <input type="number" name="ega" id="ee" min="18" max="67" placeholder="ป้อนอายุของคุณ"> 
</div>
#อธิบาย2
min="18" =ตัวกําหนดเลขเริ่มต้น (ในที่นี้คือเริ่มได้ที่18)
max="67" =ตัวกําหนดเลขสุดท้าย (ในทีนี้สิ้นสุดได้ที่67)

#ตัวที่3
<div>
    <label for="em">อีเมล</label> 
    <input type="email" name="email" id="em" placeholder="@cass.com" value="@cass.com">       
</div>
#อธิบาย3
value="" =ข้อมูลที่ถูกตั้งค่าเตรียมไว้ล่วงหน้าในช่องกรอกข้อมูลนั้น เเสดงไว้อยู่เเล้ว

#ตัวที่4
<div>
    <label for="ca">ระดับการศึกษา</label>
    <select name="cass" id="ca">
        <option value="มัธยมศึกษา">มัธยมศึกษา</option>
        <option value="ปริญญาตรี">ปริญญาตรี</option>
        <option value="ปริญญาโท">ปริญญาโท</option>
        <option value="ปริญญาเอก">ปริญญาเอก</option>
    </select>
</div>  
#อธิบาย4
<select ข้อมูลบลาๆ> =กล่องเมนูดรอปดาวน์ (เมนูแบบเลื่อนลง)
<option> </option> =ตัวเลือกแต่ละรายการใน <select> 
#<option value="ค่าที่จะให้ถูกส่งไปให้ระบบหลังบ้าน">ข้อความที่เเสดง</option>
<option> </option> =ตัวเลือกแต่ละรายการ
</select> ตัวปิดปะกบท้าย

#ตัวที่5
<div> <!--เลือกได้ตัวเลือกเดียว-->
    <label>เพศ</label>
    <input type="radio" name="plll">หญิง
    <input type="radio" name="plll">ชาย
    <input type="radio" name="plll">อื่นๆ
</div>
<div> <!--อันนี้เลือกได้หลายตัวเลือก-->
    <label>สิ่งที่ชอบ</label>
    <input type="checkbox" name="lppp">นอนเน่า
    <input type="checkbox" name="lppp">ไถตต.
    <input type="checkbox" name="lppp">เขียนโค้ด
    <input type="checkbox" name="lppp">อื่นๆ
</div>
#อธิบาย5
#อันนี้เลือกได้ตัวเลือกเดียว
<input type="radio" name="ชื่อต้องเหมือนกัน">ตัวเลือก
#อันนี้เลือกได้หลายตัวเลือก
<input type="checkbox" name="ชื่อต้องเหมือนกัน">ตัวเลือก

#ตัวที่6 
<input type="submit" value="บันทึกข้อมูล">
<input type="reset" value="ล้างข้อมูล">
#อธิบาย6
ไม่มี <label> </label>
type="submit" =ส่งข้อมูลไปหลังบ้าน
type="reset" =ล้างข้อมูล

2.ส่วนรับข้อมูลที่หลากหลาย

ช่องกรอกข้อความทั่วไป:
type="text"(ข้อความต่างๆ)
type="email"(อีเมลต่างๆ)
type="password"(รหัสผ่านที่มีระบบซ่อนตัวอักษร)

ส่วนรับข้อมูลที่มีความเฉพาะทาง:
type="number"(จำกัดช่วงอายุด้วย min และ max),(มีตัวขึ้นตัวลง)
type="date"(เลือกวันเกิด มีปฎิทินให้กด)
type="tel"(สําหรับเบอร์โทร)
<input type="url">(สำหรับเว็บไซต์)

การเลือกตัวเลือก (Selection):
ใช้ <select เนื้อหาไม่ต้องมี type> <option> </option> </select> (ไม่ต้องมี type)
#<option value="ค่าที่จะให้ถูกส่งไปให้ระบบหลังบ้าน">ข้อความที่เเสดง</option>
ใช้ <input> เเละ type="radio"(เลือกได้ตัวเลือกเดียว)
ใช้ <input> เเละ type="checkbox"(เลือกได้หลายตัว)

การอัปโหลดและลูกเล่นอื่นๆ:
type="file"(สําหรับใส่ไฟล์)
type="range"(สําหรับตัวเลข มีแถบเลื่อนตัวเลข)
type="color"(เลือกสีได้)
<textarea> </textarea>(ข้อความเเบบยาว ไม่ต้องมีtype)

ปุ่มควบคุมระบบ:
<input type="submit"> (สำหรับกดส่งข้อมูลทั้งหมดในฟอร์มไปยังระบบหลังบ้าน)
<input type="reset">: (สำหรับล้างข้อมูลทั้งหมดในฟอร์มให้กลับมาค่าเริ่มต้น)

3.แท็กหลักๆ ที่ "ต้องคุ้นตา"

กลุ่มโครงสร้างหน้าเว็บ:
<html>(ตัวครอบทั้งเว็บ)
<body>(เนื้อหาที่แสดงผลบนหน้าจอ)
<div>(กล่องสารพัดประโยชน์ เอาไว้จัดกลุ่ม)

กลุ่มข้อความและลิงก์:
<h1>ถึง<h6>(หัวข้อตัวใหญ่-เล็ก)
<p>(ย่อหน้าข้อความทั่วไป)
<a>(ลิงก์พาไปหน้าอื่น)

กลุ่มฟอร์มรับข้อมูล (อันนี้แหละที่สายไซเบอร์ต้องแม่นที่สุด!):
<form>(กรอบฟอร์มทั้งหมด)
<input>(ช่องกรอกข้อมูล ช่องติ๊ก หรือปุ่มกด เช่น type="text", type="password", type="submit")
<button>(ปุ่มกด)
<label>(ป้ายชื่อกำกับช่องกรอก)

"class เเละ id"
class =เเท็กต่างๆ ที่ต้องการรูปเเบบเหมือนกัน เช่น ต้องการสีเหมือนกัน (ซํ้าได้)
       เวลากําหนดสไตล์ให้ใช้ .ชื่อคลาส
id    =ซํ้าไม่ได้เป็นชื่อเฉพาะ ต้องการมีเเบบเดียว เเตกต่างไม่เหมือนใคร
       เวลากําหนดสไตล์ให้ใช้ #ชื่อid
ตัวอย่างการใช้
<html>
<head>
    ตั้งค่าต่างๆ
    <style> #สไตล์ให้กําหนดใน<head>
      .d{color: brown;} <!-- .ชื่อคลาส-->
      .g{color: blue;}
      #a{color: green;} <!-- #ชื่อid-->
    </style> 
</head>
<body>
    <h1 id="a">aom</h1>  <!--อันนี้จะเป็นเเท็ก id (green)--> 
    <h1 class="g">aom</h1>  <!--อันนี้จะเป็นเเท็กคลาส g (blue)--> 
    <h1 class="d">aom</h1>  <!--อันนี้จะเป็นเเท็กคลาส d (brown)--> 
    <h1 class="g">aom</h1>  <!--อันนี้จะเป็นเเท็กคลาส g (blue)--> 
    <h1 class="d">aom</h1>  <!--อันนี้จะเป็นเเท็กคลาส d (brown)--> 
</body>
</html>
"""