#SQL
"""
"โปรเเกรม BD Browser"

"การสร้างฐานข้อมูล"
1) กดตัว New Database ตรงเเท็บ
#image:./1.jpg 
เเละเซ็ฟไฟล์

2) ตั้งชื่อหัวมุม (ในทีนี้เป็นคํา Empioyee)
เเละกด add เพื่อเพิ่ม หัวข้อคอลัมน์
#image:./2.jpg

"การกำหนดชนิดและคุณสมบัติของข้อมูลในคอลัมน์"
1)ปรับ type เเละ คุณสมบัติ ตามที่ต้องการ
#image:./3.jpg

TYPE:
INTEGER -> ตัวเลขจำนวนเต็ม 
TEXT -> ตัวหนังสือ/ข้อความ 
BLOB -> ไฟล์ไบนารี/ไฟล์สื่อ 
REAL -> ตัวเลขทศนิยม (ไม่เเน่นอน)
NUMERIC -> ตัวเลขทั่วไป/วันที่ (เเน่นอน)

คุณสมบัติ:
NN -> ห้ามปล่อยว่าง 
PK -> คีย์หลัก ข้อมูลในช่องนี้ห้ามซ้ำ 
AI -> รันเลขให้อัตโนมัติ พอมีคนสมัครใหม่มันจะรัน idให้เอง 
U  -> ห้ามซ้ำกัน ข้อมูลในคอลัมน์นี้ห้ามซ้ำกับคนอื่น

"การรันให้กดคีย์รัด F5"

"การบันทึกข้อมูล"
#image:./4.jpg
1) ไปที่เเท็บ Execute SQL 

#image:./5.jpg
2) เเล้วกดปุ่มเพิ่มเเท็กมันก้จะขึ้น SQL 1

3) คําสั่งบันทึกข้อมูล
#image:./7.jpg
INSERT INTO ชื่อตาราง (หัวข้อคอลัมน์,หัวข้อคอลัมน์,หัวข้อคอลัมน์)
VALUES ('ข้อมูล','ข้อมูล',888);
ถ้าตั้งค่า TYPE เป็นเเบบข้อความให้ใส่ 'ข้อความ'
ถ้าตั้งค่า TYPE เป็นเเบบตัวเลขให้ใส่เลขเข้าไปเลย 888

"การสอบถามข้อมูล"
1) ต้องการทราบข้อมูลเเค่บางคอลัมน์
#image:./6.jpg
SELECT ชื่อคอลัมน์,ชื่อคอลัมน์
FROM ชื่อตาราง

2) ต้องการทราบข้อมูลทุกคอลัมน์
#image:./8.jpg
SELECT *
FROM ชื่อตาราง

3) ต้องการทราบข้อมูล(เงื่อนไขที่ต้องการค้นหา)
โครงสร้าง
SELECT * 
FROM ชื่อตาราง
WHERE ชื่อคอลัมน์ LIKE 'เงื่อนไข'

เงื่อนไขที่ 1 หาคําที่ขึ้นต้นด้วยคํานี้('ตัวอักษรเเรก%')
#image:./9.jpg

เงื่อนไขที่ 2 หาคําที่ลงท้ายด้วยคำนี้('%ตัวอักษรสุดท้าย')
#image:./10.jpg

เงื่อนไขที่ 3 หาคำนี้อยู่ตรงไหนก็ได้('%คำที่ต้องการ%')
#image:./11.jpg

4) ต้องการทราบข้อมูล(เงื่อนไขเปรียบเทียบ)
โครงสร้าง
SELECT *
FROM ชื่อตาราง
WHERE ชื่อคอลัมน์ =!=<><=>= 'คําที่ระบุ'

เงื่อนไขที่ 1 (=) หาคําที่มีค่า เท่ากับ คําที่ระบุ
#image:./12.jpg

เงื่อนไขที่ 2 (!=) หาคําที่มีค่า ไม่เท่ากับ คําที่ระบุ
#image:./13.jpg

เงื่อนไขที่ 3 (>) หาคําที่มีค่า มากกว่า คําที่ระบุ
#image:./14.jpg

เงื่อนไขที่ 4 (<) หาคําที่มีค่า น้อยกว่า คําที่ระบุ
#image:./15.jpg

เงื่อนไขที่ 5 (>=) หาคําที่มีค่า มากกว่าหรือเท่ากับ คําที่ระบุ
เงื่อนไขที่ 6 (<=) หาคําที่มีค่า น้อยกว่าหรือเท่ากับ คําที่ระบุ

5) ต้องการทราบข้อมูล(เงื่อนไข AND OR NOT)
โครงสร้าง
SELECT *
FROM ชื่อตาราง
WHERE เงื่อนไขที่ 1  AND OR NOT เงื่อนไขที่ 2

เงื่อนไขที่ 1 AND เเละ (ต้องถูกทั้ง 2 เงื่อนไข ถึงจะเเสดงผล)
#image:./16.jpg

เงื่อนไขที่ 2 OR หรือ (ถูกอันใดอันหนึ่ง ก้เเสดงผลเเล้ว)
#image:./18.jpg

เงื่อนไขที่ 3 NOT ไม่ (เเสดงเอาทุกอย่าง ยกเว้นสิ่งที่ระบุไว้หลังNOT)
#image:./17.jpg

"การดึงข้อมูลข้ามตาราง"
เรามี 2 ตาราง:
1) ตารางคน (Users) มี ID ลูกค้า
2) ตารางของ (Orders) มีรายการสั่งซื้อกับรหัสคนซื้อ

''''ถ้าเราอยากรู้ว่า "ใครซื้ออะไรบ้าง?" เราต้องเอา 2 ตารางนี้มารวมกัน''''

โครงสร้าง
#image:./19.jpg
SELECT  ชื่อตาราง1 . ชื่อคอลัมน์ , ชื่อตาราง2 . ชื่อคอลัมน์
FROM ชื่อตารางที่ 1 ค่าเริ่มต้น
JOIN ชื่อตารางที่ 2 ON ตารางที่ 1 . ชื่อคอลัมน์เชื่อม = ตารางที่ 2 . ชื่อคอลัมน์เชื่อม
"""