#สรุป Python day3
"""
"While Loop(การวนซํ้า)"
ไม่รู้จํานวนรอบการทําซํ้า
"""
print("อันนี้เเบบ While Loop")
cou=11 #กําหนดตัวเเปร ในที่นี้เป็น 11
while cou>0: #ตรวจสอบข้อมูลในตัวเเปรว่ามากกว่า 0 มั้ย
    cou-=1 #ถ้าเงื่อนไขเป็นจริงก้จะลบค่าตัวเเปรขึ้น -1
    print("นับถอยหลัง",cou) #เเล้วก้นําเอาค่าล่าสุดมาเเสดงผล (มันก้จะทําซํ้าไปเรือยๆจนเท่ากับ 0)
print("หมดเวลา")

"""
"For Loop(การวนซํ้า)"
รู้จํานวนรอบการทําซํ้า
"""
print("เเบบที่1กําหนดเเค่ครั้งที่ให้ทํา")
for dou in range(6): #for + ตัวเเปร + in range(จํานวนครั้งที่จะให้ทําอันนี้เริ่มจาก 0):
    print("hi python") #เเสดงผล hi python ตามจํานวนที่กําหนด
#อันนี้ไว้เช็คจํานวนรอบ
for dou in range(6): #เหมือนเดิม 
    print(dou) #เเต่ค่าเเสดงผลให้ใช้ตัวเเปรเเทน ตัวเเปรไม่ต้องมี "

print("เเบบที่2เพิ่มจํานวนเริ่มต้น")
for mou in range(1,6): #for + ตัวเเปร + in range(จํานวนเริ่มต้น , ครั้งที่จะให้ทํา):
    print("hi aom") #เเสดงผล hi aom ตามจํานวนที่กําหนด
#อันนี้ไว้เช็คจํานวนรอบ
for mou in range(1,6): #เเต่ในที่นี้จะเเสดงค่าเป็น 1-5 ไม่ถึง 6 
    print(mou) #ตัวเเปรไม่ต้องมี "

print("เเบบที่3เพิ่มจํานวนรอบที่ให้ขึ้น(อันนี้ที่ละ2)")
for kou in range(1,6,2): #for + ตัวเเปร + in range(จํานวนเริ่มต้น , ครั้งที่จะให้ทํา , รอบที่จะให้ขึ้น):
    print(kou) #ตัวเเปรไม่ต้องมี "

"""
"คําสั่งเกี่ยวกับ Loop"
break จบการทํางานในลูปเเล้วไปทําคําสั่งอื่นนอกลูปทันที
continue จบการทํางานเเล้วลูปเก่า ไปทํางานที่ลูปใหม่
"""
print("คําสั่ง break")
for tou in range(1,11): #for ปกติ ในที่นี้คือ1-10
    if tou==6: #if ตัวเเปร=6 (=มี2อันอย่าลืม) 
        break #เมื่อค่าตัวเเปรถึง6 จะจบการทํางานทันที 1-5เเละก้จบ (อย่าลืมย่อหน้า)
    print(tou) #สั่งปริ้นตัวเเปร 1-5

print("คําสั่ง continue")
for pou in range(1,11):
    if pou==6: #เมื่อตัวเเปรถึงเลข 6 จะข้ามเลข 6 เเล้วไปเลข 7 เลย
        continue #อย่าลืมย่อหน้า
    print(pou) #สั่งปริ้นตัวเเปร ยกเว้น 6

"""
"ลูปซ้อนลูป(Nested-Loop)"
for i in range(....): #ลูปนอก
    for j in range(....): #ลูปใน
    (Loopย่อยจะทํางานได้ก้ต่อเมื่อLoopหลักถูกทํางาน)
"""
print("ลูปซ้อนลูป")
for i in range(1,6): #ลูปนอก
    print("รอบที่",i) #ปริ้นลูปนอก
    for j in range(3) : #ลูปใน
        print(j) #ปริ้นลูปใน

"""
output ก้จะรันลูปนอกก่อน เเล้วก้ค่อยรันลูปในให้ครบ เเล้วก้รันลูปนอกต่อ เเล้วก้ทําเเบบเดิมจนครบลูปนอก
รอบที่ 1  #ลูปนอก 5 ลูป
0 #ลูปใน 3 ลูป
1
2
รอบที่ 2 #ลูปนอก
0 #ลูปใน
1
2
รอบที่ 3 #ลูปนอก
0 #ลูปใน
1
2
รอบที่ 4 #ลูปนอก
0 #ลูปใน
1
2
รอบที่ 5 #ลูปนอก
0 #ลูปใน
1
2
"""