#เเม่สูตรคูณ(เเบบกําหนดช่วง)
s=int(input("เเม่สูตรคูณเริ่มต้น :")) #input รับเเม่สูตรคูณเริ่มต้น เเปลงเป็นจํานวนเต็มด้วย
e=int(input("เเม่สูตรคูณสุดท้าย :")) #input รับเเม่สูตรคูณอันสุดท้าย

print("-----------------") #ปริ้นอันนี้กันไว้ระหว่างตัว input กับเเม่สูตรคูณ
for num in range(s,e+1): #ลูปนอก
    print("สูตรคูณเเม่",num) #ปริ้น ตัวเเปร num ที่ได้จาก s,e(+1)
    print("-----------------") #ปริ้นอันนี้กันไว้ระหว่างเเม่สูตรคูณด้วย
    for i in range(1,16): #ตัวเเปรi จะรัน 1-15
        print(num,"x",i,"=",num*i) #เอาตัวเเปร num ไปคูณกับตัวเเปร i
    print("-----------------") ##ปริ้นอันนี้ปิดท้ายเเม่สูตรคูณไว้
# python Project10.py