#สรุป Python day1
print(1+1) #บวกเลขไม่ต้องใส่ "
print("Hi Python") #เเสดงข้อความ (string) ให้ใส่ "
#print("Hi Python") ถ้าเอา # ไว้ข้างหน้าจะเป็นการยกเลิกคําสั่ง
'''
การเขียนอธิบายโค้ด
ที่มีหลายบันทัด ยาวๆ
หรือยกเลิกโค้ดเยอะๆ
มักใช้ ' 3ตัวกํากับ
'''
#"ข้อมูลประเภทตัวเลข"
print("10//int") #intคือจํานวนเต็ม
print("99.99//float") #floatคือจํานวนทศนิยม
print("3+5j//complex") #complexคือจํานวนเชิงซ้อน

#"ตัวเเปร"
#ให้นําค่าทางขวามือของเครื่องหมาย = ไปเก็บไว้ในตัวเเปรที่อยู่ด้านซ้ายมือ
name="jk"
age=15 #เลขไม่ใส่ "
#ตัวเเปลหลายตัวเเปล
name,age="jk",15
'''
"กฎการตั้งชื่อตัวเเปร"
- ห้ามขึ้นต้นด้วยตัวเลข
- ห้ามใช้อักขระพิเศษ [] %
- ตั้งชื่อห้ามซํ้าคําสงวน
- ตัวพิมเล็กพิมใหญ่ความหมายต่างกัน
'''
name="jk" #ตัวเเปรที่1
print(name) #ปริ้นตัวเเปร name
NAME="KK" #ตัวเเปรที่2 ชื่อตัวเเปรเหมือนกันเเต่เป็นพิมใหญ่
print(NAME) #)ปริ้นตัวเเปร NAME (พิมใหญ่)
NaMe="jj" #ตัวเเปรที่3 ชื่อเหมือนกันเเต่มีทั้งตัวใหญ่ตัวเล็ก
print("name =",NaMe) #ปริ้นตัวเเปร NaMe (ผสมกัน) ส่วน "name =" จะอยู่หน้าตัวเเปล

#เเสดงชนิดข้อมูล
print(type(NaMe)) #<class 'str'> คือการบอกว่ามันคือข้อความ (string)
print(type("jj")) #หรือจะเอาข้อมูลถามตรงๆเลยก้ได้

"""
"การเเปลชนิดข้อมูล"
int(ข้อมูล) เเปลงเป็นจํานวนเต็ม
float(ข้อมูล) เเปลงเป็นจํานวนทศนิยม
str(ข้อมูล) เเปลงเป็นข้อความ (string)
"""
print(float(age)) #คําตอบจะเป็น15.0 เพราะage=15 

"""
"ตัวดําเนินการทางคณิตศาสตร์"
+ บวก - ลบ * คูณ
/ หาร % หารเอาเศษ
** ยกกําลัง // หารไม่เอาเศษ (ไม่จุดทศนิยม)
"""
#เตรียมข้อมูล
number1,number2=5,2

print("number1 =",number1)
print("number2 =",number2)

#คํานวน
print("=",number1+number2) #บวก
print("=",number1-number2) #ลบ
print("=",number1*number2) #คูณ
print("=",number1**number2) #ยกกําลัง
print("=",number1/number2) #หาร
print("=",number1//number2) #หารไม่เอาเศษ(จํานวนเต็ม)
print("=",number1%number2) #หารเอาเศษ

"""
"ตัวดําเนินการกําหนดค่า"
ฝิวสมการอยากให้คํานวน x y คํานวนเสร็จก้ไปเก็บไว้ที่ x ต่อ
+= -= *= /= %= //= **=
"""
#เตรียมข้อมูล
x,y=10,2

print("X =",x)
print("Y =",y)

#คํานวน
x+=y #x=x+y ไม่ต้องไปทําในวงเล็บ ให้มันบวกกันเสร็จก่อนเดียวมันก้ไปเก็บไว้ที่ x ต่อ
#ดังนั้นค่อยปริ้นที่ x อีกที
print("=",x) #x=12

"""
"การรับข้อมูลผู้ใช้"
ตัวเเปร=input(ข้อความที่จะเเสดงก่อนรับข้อมูล)
"""
fey=input("your name:") #รับข้อมูล
print(fey) #ปริ้นfey