#สรุป Python day2
'''
"ตัวดําเนินการเปรียบเทียบ(True/False)"
==เท่ากับ !=ไม่เท่ากับ >มากกว่า 
<น้อยกว่า >=มากกว่าหรือเท่ากับ <=น้อยกว่าหรือเท่ากับ
'''
#กําหนดตัวเเปร
x,y=100,50 
print(x==y) #ไม่ต้องใส่ " ค่าจะได้ False เพราะมันไม่เท่ากัน
print(x!=y) #ค่าจะได้ True

'''
"คําสั่งเงื่อนไข(if statement)"
- if # 1 เงื่อนไข คําสั่งต่างๆเมื่อเงื่อนไขเป็นจริง
- if-else # 2 เงื่อนไข ถ้าเงื่อนไขที่ 1 ไม่เป็นจริงมันก้จะปริ้นเงื่อนไขที่ 2 เเทน 
- if-elif-else # 3 เงื่อนไข ถ้าเงื่อนไขข้างบนไม่เป็นจริงมันก้จะปริ้นอันสุดท้ายเเทน 
'''
#กําหนดตัวเเปร
r,t=800,900
#วิธีการเขียน(if statement)
if r!=t:
    print("เงือนไขเป็นจริง") #ตัวนี้จะปริ้นก้ต่อเมื่อ r ไม่เท่ากับ t 
else: 
    print("เงือนไขไม่เป็นเท็จ") #ตัวนี้จะปริ้นก้ต่อเมื่อเงื่อนไขอันที่ 1 เป็นเท็จ

'''
"Ternary Operator"
การเขียน if-else เเบบลดรูป 
'''
#เเบบลดรูป
print("เงือนไขเป็นจริง") if r!=t else print("เงือนไขไม่เป็นเท็จ")

'''
"ตัวดําเนินการทางตรรกศาสตร์"
andเเละ ต้องTทั้งคู่ถึงจะT 
orหรือ  มีTตัวใดตัวใดตัวหนึ่งก้Tหมด
notไม่  ตรงข้ามอันเดิมฝิวนิเสธ
'''
#ใช้เชื่อมระหว่างตัวเเปร หรือใช้นําหน้า เช่น not name=="admin" ไปดูรายละเอียดใน Project5กับ6

'''
"Nested-if(เงื่อนไขซ้อน)"
if เงื่อนไขหลัก:
  if เงื่อนไขย่อย:
     (ifย่อยจะทํางานได้ก้ต่อเมื่อifหลักถูกทํางาน)
'''
# ดูรายละเอียดได้ที่ Project7

'''
"คําสั่งเงื่อนไข(Match Statement)"
match ตัวเเปร:
    caseค่าที่ 1: คําสั่งต่างๆ
    caseค่าที่ 2: คําสั่งต่างๆ
    caseค่าที่ n: คําสั่งต่างๆ
    caseค่าที่ " ": คําสั่งต่างๆ #ถ้าไม่ใส่ข้อมูลมันก้จะทำหน้าที่รองรับทุกกรณีที่เหลือจากด้านบนทันที
'''
#ดูรายละเอียดได้ที่ Project8