name=input("ป้อนชื่อผู้ใช้:")
password=input("ป้อนรหัสผ่านของคุณ:")

if name=="mamber" and password=="1234": #ifหลัก ==มี2อัน
    print("เข้าสู่ระบบสําเร็จ")
    service=input("ป้อนหมายเลขบริการ(1-2):")
    if service=="1" :  #ifย่อยจะทํางานได้ก้ต่อเมื่อifหลักถูกทํางาน
        print("ถอนเงิน")
    elif service=="2":
        print("ฝากเงิน")
    else: #ตัวนี้ไม่ต้องพิมข้อมูล เพราะมันจะทำหน้าที่รองรับทุกกรณีที่เหลือจากด้านบนทันที
        print("หมายเลขบริการไม่ถูกต้อง")
else:
    print("ไม่พบบัญชีผู้ใช้")
# python Project7.py