#สรุป Python day4
"""
"ฟังก์ชันเเบบปกติ(Function)"
"""
#การสร้างฟังก์ชัน
def sayheiio(): #def ชื่อฟังก์ชัน():
    print("เเม่สูตรคูณเเม่ 2")  #สิ่งที่จะให้ทํา

def show(): #def ชื่อฟังก์ชัน():
    print("---------") #สิ่งที่จะให้ทํา
    for i in range(1,13):
        print("2 x",i,"=",2*i)

#การเรียกใช้งาน
sayheiio() #ชื่อฟังก์ชัน()
show() #ชื่อฟังก์ชัน()

"""
"ฟังก์ชันเเบบมีพารามิเตอร์"
ก้จะเพิ่มตัวเเปรรับ กับตัวเเปรส่ง
ตัวเเปรรับ (nameuu,age)
ตัวเเปรส่ง "ออมม",15
เเต่ถ้าไม่อยากพิมหลายรอบ 
time="ตอนเช้า" #พิมตัวเเปรเข้าไปเลย
use(time,"ออมม",15)
"""
#การสร้างฟังก์ชัน
def use(time,nameuu,age): #parameter ตัวเเปรรับ
    print("สวัสดี",time,nameuu) #ส่งที่จะให้ทํา
    print("ปีนี้คุณมีอายุ",age,"ปี")

def shw(num): #def ชื่อฟังก์ชัน(ตัวเเปร):
    print("----เเม่",num,"-----") #สิ่งที่จะให้ทํา
    for i in range(1,13):
        print(num,"x",i,"=",num*i)

#การเรียกใช้งาน
time="ตอนเช้า" #พิมตัวเเปรเข้าไปเลย
use(time,"ออมม",15) #arguments ตัวเเปรส่ง
use(time,"เเมวว",16) #ตัวเเปรส่ง
shw(4) #ป้อนข้อมูลที่จะให้เเสดงลงไป
shw(5) #สามารถป้อนได้หลายข้อมูล

"""
"ฟังก์ชันกําหนดค่าเริ่มต้น"
"""
def gg(tuii,dftt,mumy=35000): #=35000 เป็นการกําหนดเงินเดือนค่าเริ่มต้น
    print("ชื่อพนักงาน",tuii,"เเผนก",dftt)
    print("เงินเดือน",mumy)
    print("-------------")
gg("ออม","ไซเบอร์สีเคียว",40000)
gg("ม่อน","ไอที") #ถ้าไม่ระบุเงินเดือนเวลารันมันก้จะเด้งให้เป็น 35000เองเลย

"""
"Argumunts(เเบบลําดับ(*args))"
"""
print("ฟังก์ชัน( * อะไรก้ได้ )")
def gy(*t): #ใช้เเทน parameter ยาวๆ
    print("ชื่อพนักงาน",t[0],"เเผนก",t[1]) #ใช้เลข0-n เพื่อกําหนดลําดับเเทน
    print("เงินเดือน",t[2]) #t[n]
    print("-------------")

gy("ออม","ไซเบอร์สีเคียว",40000) #0คือชื่อ 1คือเเผนก 2คือเงินเดือน
gy("ม่อน","ไอที",45000)

"""
"Argumunts(เเบบกําหนดชื่อ(**kwargs))"
สําหรับคนสับสนในเลข
"""
print("ฟังก์ชัน( ** อะไรก้ได้ )")
def gy(**pol): #ใช้เเทน parameter ยาวๆ
    print("ชื่อพนักงาน",pol["nnn"],"เเผนก",pol["ddd"]) #ใช้ ชื่อเพื่อกําหนดลําดับเเทน
    print("เงินเดือน",pol["sss"]) #pol["sss"]
    print("-------------")

gy(nnn="ออม",ddd="ไซเบอร์สีเคียว",sss=40000) #0คือชื่อ 1คือเเผนก 2คือเงินเดือน
gy(nnn="ม่อน",ddd="ไอที",sss=45000)

"""
"ฟังก์ชันเเบบมีค่าส่งกลับ"
"""
def home():
    return "หนองหญ้าขาว" #ส่งค่าคำว่า "หนองหญ้าขาว" ออกมาจากฟังก์ชัน

mydata = home() #เรียกใช้ฟังก์ชัน แล้วเอาค่าที่ส่งกลับมาเก็บไว้ในตัวแปร mydata
print("บ้านของฉันอยู่",mydata)

"""
"ฟังก์ชันเเบบรับเเละส่งค่า"
"""
def citnum(mmm): #สร้างฟังก์ชันชื่อ citnum ที่ต้องรับตัวแปรพารามิเตอร์ชื่อ mmm เข้ามา
    if mmm%2==0: #เช็คว่าเอาค่า mmm ไปหาร 2 แล้วเหลือเศษ 0 หรือไม่
        return "เลขคู่" #ถ้าใช่ จะ return คำว่า "เลขคู่" กลับออกไป
    else:
        return "เลขคี่" #ถ้าไม่ใช่ return คำว่า "เลขคี่" กลับออกไป

rettt = citnum(4) #เรียกใช้ฟังก์ชัน ส่งเลข 4 เข้าไปคำนวณ แล้วเอาผลลัพธ์ที่รีเทิร์นกลับมาเก็บไว้ในตัวแปร rettt
print("ผลลัพธ์ =",rettt)