#สรุปวิธีอ่านไฟล์ที่เป้นสกุล.txt (ใช้ไฟล์.pyอ่าน)

#"คําสั่งเปิดไฟล์ เเบบที่1"
file=open("ชื่อไฟล์.txt") #ถ้าไฟล์มีภาษาไทยให้พิม ,encoding="utf-8"
#คําสั่งอ่านไฟล์
print(file.read())
#ข้อเสียคืออ่านเสร็จต้องปิดไฟล์ทุกครั้งไม่งั้นจะ Error
file.close()

#"คําสั่งเปิดไฟล์ เเบบที่2"
with open("ชื่อไฟล์.txt","r",encoding="utf-8") as file:
    print(file.read())
    #อันนี้มันจะปิดไฟล์ให้เอง

#"เขียนไฟล์ทับเข้าไป"  
with open("ชื่อไฟล์.txt","w",encoding="utf-8") as file:
    file.write("รหัสเทสคับไอหรรม")

#"เขียนไฟล์เพิ่มเข้าไป ต่อท้ายอันเดิม"
with open("ชื่อไฟล์.txt","a",encoding="utf-8") as file:
    file.write("รหัสเทสคับไอหรรม")

#"สร้างไฟล์ใหม่ เเล้วเขียนเนื้อหาเข้าไป"
with open("ชื่อไฟล์ใหม่.txt","x",encoding="utf-8") as file:
    file.write("676767")

'''
"การอ่านที่ละบรรทัด(หารหัสหรือข้อความที่ตามหา)"
1) กําหนดตัวเเปลกับข้อความ
ตัวเเปร=รหัสหรือข้อความที่ตามหา
2) ใช้คําสั่งเปิดไฟล์ เเบบที่2
wวิท เปิด ("ชื่อไฟล์.txt","r",encoding="utf-8") เเอด ไฟล์:
    ฟอร์ ลิง อิน ไฟล์: #คําสั้่งวงซํ้า
        ตัวเเปรที่2=ลิง.สตาร์()
        ปริ้น ("กําลังลองรหัส :",ตัวเเปรที่2)        
'''
passwords="root"
with open("words.txt","r",encoding="utf-8") as file:
    for line in file:
        pp=line.strip()
        print("กําลังลองรหัส:",pp)       
        if pp==passwords: #เงื่อนไข
            print ("เจาะระบบสําเร็จ รหัสผ่านคือ",passwords)
            break #ถ้าเจอก้จะหยุดการทํางาน       
    else: #ถ้าไม่เจอก้จะปริ้นว่าไม่พบรหัส
        print ("ไม่พบรหัสผ่าน")    

"""
กําลังลองรหัส: admin123
กําลังลองรหัส: password123
กําลังลองรหัส: 12345678
กําลังลองรหัส: root
เจาะระบบสําเร็จ รหัสผ่านคือ root
"""